trunk/CourseWork/ror/VenkatCodeSamples/06232010/grads/app/controllers/graduates_controller.rb

SELECT * FROM "graduates"
---
  def index
    @graduates = Graduate.all

SELECT * FROM "graduates" WHERE ("graduates"."id" = 1)
---
  def show
    @graduate = Graduate.find(params[:id])

SELECT * FROM "graduates" WHERE ("graduates"."id" = 1)
---
  def edit
    @graduate = Graduate.find(params[:id])

SELECT * FROM "graduates" WHERE ("graduates"."id" = 1)
UPDATE "graduates" SET "updated_at" = '2010-06-24 00:08:47', "first_name" = 'John<xml>' WHERE "id" = 1
---
  def update
    @graduate = Graduate.find(params[:id])

    respond_to do |format|
      if @graduate.update_attributes(params[:graduate])