trunk/CourseWork/ror/VenkatCodeSamples/06222010/grads/app/controllers/graduate_advisors_controller.rb

  def disp
    @year = params[:year]
    @year ||= 2009

    @graduates = Graduate.find_all_by_year_of_graduation(@year)
---
SELECT * FROM "graduates" WHERE ("graduates"."year_of_graduation" = 2009) LIMIT 1