trunk/CourseWork/ror/Assign4/library2/app/controllers/books_controller.rb

  def create
    @book = Book.new(params[:book])
    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("created_at", "title", "updated_at", "publisher_id") VALUES('2010-06-25 20:30:19', NULL, '2010-06-25 20:30:19', NULL)

  def update
    @book = Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 980190962)

  def destroy
    @book = Book.find(params[:id])
    @book.destroy
---
SELECT * FROM "books" WHERE ("books"."id" = 980190962)
DELETE FROM "books" WHERE "id" = 980190962