cps/ardunio/app/controllers/stations_controller.rb

  def index
    @graph_interval = 2 # hours
    @station = Station.find(1)
    @reading = @station.readings.first(:order => 'created_at DESC')
---
SELECT * FROM "stations" WHERE ("stations"."id" = 1)
SELECT * FROM "readings" WHERE ("readings"."created_at" >= '2011-05-09 21:44:03' AND "readings"."created_at" < '2011-05-09 23:44:03') AND ("readings".station_id = 1) ORDER BY created_at
SELECT * FROM "stations"

  def show
    @station = Station.find(params[:id])
---
SELECT * FROM "stations" WHERE ("stations"."id" = 1)

  def create
    @station = Station.new(params[:station])

    respond_to do |format|
      if @station.save
---
INSERT INTO "stations" ("name", "created_at", "updated_at") VALUES('', '2011-05-10 00:12:50', '2011-05-10 00:12:50')

  def destroy
    @station = Station.find(params[:id])
    @station.destroy
---
SELECT * FROM "stations" WHERE ("stations"."id" = 2)
DELETE FROM "stations" WHERE "id" = 2