ror/Assign3/library/app/controllers/authors_controller.rb

  def index
    @authors = Author.all
---
SELECT * FROM "authors"

  def show
    @author = Author.find(params[:id])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 1907420170)

  def show_books_of_author
    @author = Author.find(params[:id])
    @books = @author.books
    flash[:notice] = 'Sorry No books found..'if (@books.size ==0 || @books == nil)
---
SELECT * FROM "authors" WHERE ("authors"."id" = 1907420170)
SELECT * FROM "books" INNER JOIN "authors_books" ON "books".id = "authors_books".book_id WHERE ("authors_books".author_id = 1907420170 )

  def edit
    @author = Author.find(params[:id])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 1907420170)

  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("updated_at", "first_name", "last_name", "created_at") VALUES('2010-06-29 05:19:21', 'Venkat', 'Subramanium', '2010-06-29 05:19:21')

  def update
    @author = Author.find(params[:id])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 1907420170)

  def destroy
    @author = Author.find(params[:id])
    if @author.books.size ==0 || @author.books==nil
      @author.destroy
---
SELECT * FROM "authors" WHERE ("authors"."id" = 511920238)
SELECT * FROM "books" INNER JOIN "authors_books" ON "books".id = "authors_books".book_id WHERE ("authors_books".author_id = 511920238 )
DELETE FROM "authors" WHERE "id" = 511920238