ror/Assign3/library/app/controllers/publishers_controller.rb

SELECT * FROM "publishers"
---
  def index
    @publishers = Publisher.all

SELECT * FROM "publishers" WHERE ("publishers"."id" = 980190962)
---
  def show
    @publisher = Publisher.find(params[:id])

SELECT * FROM "publishers" WHERE ("publishers"."id" = 2053932785)
SELECT * FROM "books" WHERE ("books".publisher_id = 2053932785)
SELECT count(*) AS count_all FROM "books" WHERE ("books".publisher_id = 2053932785)
---
  def show_books_of_publisher
    @publisher = Publisher.find(params[:id])
    @books = @publisher.books
    flash[:notice] = 'Sorry No books found..'if (@books.size ==0 || @books == nil)

SELECT * FROM "publishers" WHERE ("publishers"."id" = 980190962)
---
  def edit
    @publisher = Publisher.find(params[:id])

INSERT INTO "publishers" ("name", "updated_at", "created_at") VALUES('Oreilly', '2010-06-29 05:19:21', '2010-06-29 05:19:21')
---
  def create
    @publisher = Publisher.new(params[:publisher])

    respond_to do |format|
      if @publisher.save

SELECT * FROM "publishers" WHERE ("publishers"."id" = 980190962)
---
  def update
    @publisher = Publisher.find(params[:id])

SELECT * FROM "publishers" WHERE ("publishers"."id" = 980190962)
SELECT * FROM "books" WHERE ("books".publisher_id = 980190962)
SELECT count(*) AS count_all FROM "books" WHERE ("books".publisher_id = 980190962)
DELETE FROM "publishers" WHERE "id" = 1187371253
---
  def destroy
    @publisher = Publisher.find(params[:id])

    if @publisher.books.size ==0 || @publisher.books==nil
      @publisher.destroy