ror/Assign4/library2/app/controllers/authors_controller.rb

  def show_books_of_author
    @author = Author.find(params[:id])
    @books = @author.books
    flash[:notice] = 'Sorry No books found..'if (@books.size ==0 || @books == nil)
---
SELECT * FROM "authors" WHERE ("authors"."id" = 3)
SELECT * FROM "books" INNER JOIN "authors_books" ON "books".id = "authors_books".book_id WHERE ("authors_books".author_id = 3 )

  def create
    @author = Author.new(params[:author])
    flash[:notice] = ""
    respond_to do |format|
      if @author.save
        flash[:notice] = 'Author was successfully created.'
        format.html {render :partial => 'list', :locals => {:authors => Author.all}}
---
INSERT INTO "authors" ("updated_at", "first_name", "last_name", "created_at") VALUES('2010-07-03 03:55:04', 'Shaunak', 'Vairagare', '2010-07-03 03:55:04')
SELECT * FROM "authors"

  def update
    @author = Author.find(params[:id])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 2)

  def destroy
    @author = Author.find(params[:id])
    if @author.books.size ==0 || @author.books==nil
      @author.destroy
---
SELECT * FROM "authors" WHERE ("authors"."id" = 1)
SELECT * FROM "authors"
SELECT * FROM "books" INNER JOIN "authors_books" ON "books".id = "authors_books".book_id WHERE ("authors_books".author_id = 1 )
DELETE FROM "authors" WHERE "id" = 1