ror/Assign4/library2/app/controllers/library_controller.rb

SELECT * FROM "books" ORDER BY title
SELECT * FROM "authors" ORDER BY first_name
SELECT * FROM "publishers" ORDER BY name
---
  def home
    @books = Book.find(:all, :order => 'title')
    @authors = Author.find(:all, :order => 'first_name')
    @publishers = Publisher.find(:all, :order => 'name')

    flash[:notice] = nil
    flash[:books_status] = nil
    flash[:authors_status] = nil
    flash[:publishers_status] = nil

    flash[:books_status] = "No Books In Library yet" if @books.size ==0
    flash[:authors_status] = "No Authors Created yet" if @authors.size ==0
    flash[:publishers_status] ="No Publishers Created yet" if @publishers.size ==0