ror/Assign4/library2/app/controllers/publishers_controller.rb

SELECT * FROM "publishers" WHERE ("publishers"."id" = 1)
SELECT * FROM "books" WHERE ("books".publisher_id = 1)
SELECT count(*) AS count_all FROM "books" WHERE ("books".publisher_id = 1)
---
  def show_books_of_publisher
    @publisher = Publisher.find(params[:id])
    @books = @publisher.books
    flash[:notice] = 'Sorry No books found..'if (@books.size ==0 || @books == nil)

INSERT INTO "publishers" ("name", "updated_at", "created_at") VALUES('new publisher', '2010-07-03 05:32:49', '2010-07-03 05:32:49')
SELECT * FROM "publishers"
---
  def create
    @publisher = Publisher.new(params[:publisher])
    respond_to do |format|
      if @publisher.save
        flash[:notice] = 'Publisher was successfully created.'
        format.html {render :partial => 'list', :locals => {:publishers => Publisher.all}}

SELECT * FROM "publishers" WHERE ("publishers"."id" = 1)
SELECT * FROM "books" WHERE ("books".publisher_id = 1)
SELECT * FROM "publishers"
SELECT count(*) AS count_all FROM "books" WHERE ("books".publisher_id = 1)
DELETE FROM "publishers" WHERE "id" = 3
---
  def destroy
    @publisher = Publisher.find(params[:id])

    if @publisher.books.size ==0 || @publisher.books==nil
      @publisher.destroy