trunk/CourseWork/ror/VenkatCodeSamples/06162010/exampleCode/grads/app/controllers/graduates_controller.rb

  def index
    @graduates = Graduate.all
---
SELECT * FROM "graduates"

  def show
    @graduate = Graduate.find(params[:id])
---
SELECT * FROM "graduates" WHERE ("graduates"."id" = 1)

  def edit
    @graduate = Graduate.find(params[:id])
---
SELECT * FROM "graduates" WHERE ("graduates"."id" = 1)

  def create
    @graduate = Graduate.new(params[:graduate])

    respond_to do |format|
      if @graduate.save
---
INSERT INTO "graduates" ("created_at", "year_of_graduation", "degree_id", "updated_at", "last_name", "first_name") VALUES('2010-06-17 00:08:57', 1995, 1, '2010-06-17 00:08:57', 'Subramaniam', 'Venkat')