trunk/CourseWork/ror/FinalProject/igive/app/controllers/messages_controller.rb

SELECT * FROM "users" WHERE ("users"."name" = 'Shaunak') LIMIT 1
SELECT * FROM "messages" WHERE ("messages"."user_id" = 2053932785)
SELECT * FROM "users" WHERE ("users"."id" = 2)
---
  def index
    user=User.find_by_name(session[:user_id])

    @messages = Message.find(:all, :order => "created_at DESC")
    @messages=@messages.select {|m| m.user == user}

SELECT * FROM "users" WHERE ("users"."name" = 'Shaunak') LIMIT 1
SELECT * FROM "messages" WHERE ("messages"."user_id" = 2053932785)
SELECT * FROM "users" WHERE ("users"."id" = 298486374)
---
  def new
    @post = Post.find(params[:post_id])
    user = User.find_by_name(session[:user_id])
    @post.dibber = user.id
    @post.save

    @message = Message.new
    @message.subject = "Dib on your #{@post.title}"
    @message.sender_id =  user.id
    @message.user = User.find(@post.user_id)

INSERT INTO "messages" ("updated_at", "body", "read", "post_id", "subject", "user_id", "sender_id", "created_at") VALUES('2010-07-01 10:43:51', 'your dib got accepted', 'f', NULL, 'accepted', 1, 1, '2010-07-01 10:43:51')
---
  def create

    @message = Message.new(params[:message])
    if @message.save