trunk/CourseWork/ror/FinalProject/igive/app/controllers/posts_controller.rb

SELECT * FROM "users" WHERE ("users"."name" = 'Shaunak') LIMIT 1
SELECT * FROM "posts" WHERE (title LIKE "%book%")
SELECT * FROM "posts"
SELECT * FROM "users" WHERE ("users"."id" = 298486374)
---
  def list
    search_string = params[:searchform][:query].strip
    user= User.find_by_name(session[:user_id])
    @posts=like_search(search_string) #Post.find(:all,:conditions => 'tag LIKE "%'+ search_string + '%"')
    @posts=@posts.select{ |e| e.user_id != user.id && e.dibber == 0}

SELECT * FROM "users" WHERE ("users"."name" = 'vasu') LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."user_id" = 1 AND "posts"."exchanged" = 'f')
---
  def pending_dibs
    user= User.find_by_name(session[:user_id])
    @pending_dibs=Post.find_all_by_user_id_and_exchanged(user.id,false)

SELECT * FROM "posts" WHERE ("posts"."id" = 1051517878)
UPDATE "posts" SET "exchanged" = 't', "updated_at" = '2010-07-01 10:22:48' WHERE "id" = 1051517878
UPDATE "histories" SET "receiver_id" = 2, "updated_at" = '2010-07-01 18:36:37', "action" = 'received' WHERE "id" = 3
SELECT * FROM "users" WHERE ("users"."name" = 'Shaunak') LIMIT 1
---
  def accept_dib
    post =  Post.find(params[:id])
    post.exchanged = true
    post.save

    history = post.history
    history.receiver_id = post.dibber
    history.action = "received"
    history.save

    sendMessage("Dib Accepted",
                        "Your dib on #{post.title} has been accepted.",
    User.find_by_name(session[:user_id]).id,
    User.find(post.dibber),post)

SELECT * FROM "posts" WHERE ("posts"."id" = 1051517878)
SELECT * FROM "users" WHERE ("users"."name" = 'Shaunak') LIMIT 1
UPDATE "posts" SET "dibber" = 0, "updated_at" = '2010-07-01 10:22:48' WHERE "id" = 1051517878
---
  def reject_dib
    post =  Post.find(params[:id])

    sendMessage("Dib Rejected",
                "Sorry your dib on #{post.title} has been rejected.",
    User.find_by_name(session[:user_id]).id,
    User.find(post.dibber),post)
    post.dibber = 0
    post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 2053932785)
SELECT * FROM "users" WHERE ("users"."name" = 'Shaunak') LIMIT 1
UPDATE "posts" SET "dibber" = 0, "updated_at" = '2010-07-01 10:17:50' WHERE "id" = 4
---
  def withdraw_dib
    @post = Post.find(params[:id])
    user = User.find_by_name(session[:user_id])
    @post.dibber = 0
    @post.save

SELECT * FROM "users" WHERE ("users"."name" = 'vasu') LIMIT 1
---
  def new
    @post = Post.new
    @post.user=User.find_by_name(session[:user_id])

INSERT INTO "posts" ("dibber", "exchanged", "updated_at", "title", "tag", "description", "user_id", "created_at") VALUES(1, 'f', '2010-07-01 10:22:48', 'laptop', 'electronic', 'brand new laptop', 1, '2010-07-01 10:22:48')
SELECT * FROM "users" WHERE ("users"."name" = 'Shaunak') LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."id" = 2053932786)
SELECT * FROM "users" WHERE ("users"."id" = 298486374)
INSERT INTO "histories" ("receiver_id", "updated_at", "title", "action", "post_id", "description", "user_id", "created_at") VALUES(NULL, '2010-07-01 10:22:48', 'laptop', 'posted', 2053932786, 'brand new laptop', 2053932785, '2010-07-01 10:22:48')
---
  def create
    @post = Post.new(params[:post])
    respond_to do |format|


      if @post.save
        history = History.new
        history.title = @post.title
        history.description = @post.description
        history.user_id = User.find_by_name(session[:user_id]).id
        #history.receiver_id = 0
        history.action = "posted"
        history.post = Post.find(@post.id)
        history.save

SELECT * FROM "posts" WHERE ("posts"."id" = 980190962)
---
  def update
    @post = Post.find(params[:id])