trunk/CourseWork/ror/FinalProject/igive/app/controllers/users_controller.rb

  def edit
    @user = User.find_by_name(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."name" = 'Vasundhara') LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "password", "email") VALUES('Shaunak', '2010-06-27 03:44:47', '2010-06-27 03:44:47', 'Shaun', 'shaunak@gmail.com')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 980190962)
UPDATE "users" SET "updated_at" = '2010-06-26 21:07:17', "email" = 'vasundharadsingh@gmail.com', "name" = 'vasundhara' WHERE "id" = 2