ror/VenkatCodeSamples/06232010/grads/app/controllers/advisors_controller.rb

SELECT * FROM "graduates" WHERE ("graduates"."year_of_graduation" = '2009')
SELECT count(*) AS count_all FROM "graduates"
---
  def display
    @year = params[:year]
    @year ||= 2009

    @graduates = Graduate.find_all_by_year_of_graduation(@year)

    if @graduates.size < 1